Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/edc/PIC32CM2532JH01100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXF0A" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x420020A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0AI" edc:nzwidth="0x6" edc:desc="Rx FIFO 0 Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXBC" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x420020AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RBSA" edc:nzwidth="0x10" edc:desc="Rx Buffer Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXF1C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF7FFFFF" edc:_addr="0x420020B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F1SA" edc:nzwidth="0x10" edc:desc="Rx FIFO 1 Start Address"/>
            <edc:SFRFieldDef edc:cname="F1S" edc:nzwidth="0x7" edc:desc="Rx FIFO 1 Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1WM" edc:nzwidth="0x7" edc:desc="Rx FIFO 1 Watermark"/>
            <edc:SFRFieldDef edc:cname="F1OM" edc:nzwidth="0x1" edc:desc="FIFO 1 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXF1S" edc:nzwidth="0x20" edc:access="rr----rr--rrrrrr--rrrrrr-rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC33F3F7F" edc:_addr="0x420020B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F1FL" edc:nzwidth="0x7" edc:desc="Rx FIFO 1 Fill Level"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1GI" edc:nzwidth="0x6" edc:desc="Rx FIFO 1 Get Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1PI" edc:nzwidth="0x6" edc:desc="Rx FIFO 1 Put Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1F" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DMS" edc:nzwidth="0x2" edc:desc="Debug Message Status">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle state" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DBGA" edc:desc="Debug message A received" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DBGB" edc:desc="Debug message A/B received" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DBGC" edc:desc="Debug message A/B/C received, DMA request set" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXF1A" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x420020B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F1AI" edc:nzwidth="0x6" edc:desc="Rx FIFO 1 Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXESC" edc:nzwidth="0x20" edc:access="---------------------nnn-nnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x777" edc:_addr="0x420020BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0DS" edc:nzwidth="0x3" edc:desc="Rx FIFO 0 Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1DS" edc:nzwidth="0x3" edc:desc="Rx FIFO 1 Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RBDS" edc:nzwidth="0x3" edc:desc="Rx Buffer Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
